# Pandas
#### Series
#### DataFrames
#### Missing Data
#### GroupBy
#### Merging,Joining,and Concatenating
#### Operations
#### Data Input and Output

In [3]:
import pandas as pd

In [4]:
import numpy as np

### 1. Series

In [29]:
labels =['a','b','c']#list
my_data =[10,20,30]#list
arr = np.array(my_data)#array
d = {'x':10,'y':20, 'z':30}#dictionary

In [30]:
pd.Series(data= my_data)

0    10
1    20
2    30
dtype: int64

In [31]:
# if we want chng index from number to labels
pd.Series(data= my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [32]:
pd.Series(my_data,labels)#it also work when u not specify  data= or index=

a    10
b    20
c    30
dtype: int64

In [33]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [34]:
#when we pass dict it give key value as index nd we can not chng index on dictionary
pd.Series(d)

x    10
y    20
z    30
dtype: int64

In [35]:
ser1 = pd.Series([1,2,3,4],['usa','Germany','ussr','japan'])

In [36]:
ser1

usa        1
Germany    2
ussr       3
japan      4
dtype: int64

In [37]:
ser2=pd.Series([1,2,5,7],['usa','Germany','italy','japan'])

In [38]:
ser2

usa        1
Germany    2
italy      5
japan      7
dtype: int64

In [39]:
# accessing data of series is same  as dictionary we have to give name of index
ser2['japan']

7

In [40]:
# alway give result in float
#this operation is based on index so index should be present in both if index match not found it give NaN
ser1 + ser2

Germany     4.0
italy       NaN
japan      11.0
usa         2.0
ussr        NaN
dtype: float64

In [41]:
ser3 = pd.Series(['a','b',3,4,'d'])
ser4 = pd.Series(['x','t',6,7,'d'])
ser3 + ser4

0    ax
1    bt
2     9
3    11
4    dd
dtype: object

### 2. DataFrame

In [6]:
from numpy.random import randn

In [7]:
np.random.seed(101)

Seeding a pseudo-random number generator gives it its first "previous" value. Each seed value will correspond to a sequence of generated values for a given random number generator. That is, if you provide the same seed twice, you get the same sequence of numbers twice.

In [44]:
ax = np.random.randn(2,3)
ax

array([[ 2.70684984,  0.62813271,  0.90796945],
       [ 0.50382575,  0.65111795, -0.31931804]])

In [7]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [46]:
df

          W         X         Y         Z
A -0.848077  0.605965 -2.018168  0.740122
B  0.528813 -0.589001  0.188695 -0.758872
C -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723
E -1.706086 -1.159119 -0.134841  0.390528

In [47]:
df['Y']# this column is series

A   -2.018168
B    0.188695
C    0.190794
D    0.302665
E   -0.134841
Name: Y, dtype: float64

In [48]:
type(df['W']) # gives the data type of the column W

pandas.core.series.Series

In [49]:
type(df) # gives the datatype of dataframe df

pandas.core.frame.DataFrame

In [50]:
#want more than one column
df[['W','Z']]

          W         Z
A -0.848077  0.740122
B  0.528813 -0.758872
C -0.933237  1.978757
D  2.605967  1.693723
E -1.706086  0.390528

In [51]:
# creating new column in dataframe
df['new']= df['W'] +df['X']
df

          W         X         Y         Z       new
A -0.848077  0.605965 -2.018168  0.740122 -0.242112
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187
C -0.933237  0.955057  0.190794  1.978757  0.021819
D  2.605967  0.683509  0.302665  1.693723  3.289476
E -1.706086 -1.159119 -0.134841  0.390528 -2.865205

In [53]:
# to delete column you have to use  drop method
df.drop(['new'])#it will give error coz by default the axis=0 which corresponds to row 
# axis =0 for row
# axis = 1 for column

KeyError: "['new'] not found in axis"

In [ ]:
df.drop('new',axis=1,inplace=True)
#if inplace is not true then it not delete the data from main table now when its true it compltely delete new
#inplace is false by default

In [ ]:
df

In [ ]:
#Now to deelete a row not need to mention axis coz by default axis =0 
df.drop('E')
df #printing df right there, the E row is dropped, bu since inplace is not True it is deleted only in that instance

In [ ]:
#Printing df again, we can see that the row is still present in the dataframe
df

In [ ]:
#for completly delete E you have to mention inplace to delete from main data frame
df.drop('E',inplace=True)

In [54]:
df

          W         X         Y         Z       new
A -0.848077  0.605965 -2.018168  0.740122 -0.242112
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187
C -0.933237  0.955057  0.190794  1.978757  0.021819
D  2.605967  0.683509  0.302665  1.693723  3.289476
E -1.706086 -1.159119 -0.134841  0.390528 -2.865205

### Selecting Data
1) Using labels
2) Using location

##### Using labels --> by using loc[] 
By using loc function, we can call an element by using the label; the column names and row names
##### Using location --> by using iloc[]
By using iloc function, we can call an element by using the index of rows and columns

In [55]:
df

          W         X         Y         Z       new
A -0.848077  0.605965 -2.018168  0.740122 -0.242112
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187
C -0.933237  0.955057  0.190794  1.978757  0.021819
D  2.605967  0.683509  0.302665  1.693723  3.289476
E -1.706086 -1.159119 -0.134841  0.390528 -2.865205

In [56]:
#1. by using loc[]
# in method we pass row or column name as argument
print(df.loc[:,'Y'])

#this give series of row w.r.t column

A   -2.018168
B    0.188695
C    0.190794
D    0.302665
E   -0.134841
Name: Y, dtype: float64

In [57]:
# 2. by using iloc[]
# in this way we pass numerical index position of row
df.iloc[0:2,2:]
#this give series of row w.r.t column

          Y         Z       new
A -2.018168  0.740122 -0.242112
B  0.188695 -0.758872 -0.060187

In [58]:
# for taking value of only one cell
df.iloc[0,0]
#df.loc[0,'W']

-0.8480769834036315

In [59]:
df

          W         X         Y         Z       new
A -0.848077  0.605965 -2.018168  0.740122 -0.242112
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187
C -0.933237  0.955057  0.190794  1.978757  0.021819
D  2.605967  0.683509  0.302665  1.693723  3.289476
E -1.706086 -1.159119 -0.134841  0.390528 -2.865205

In [60]:
df.loc['D','Z'] #this give  value of  D row and Z column

1.693722925204035

In [61]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.605965 -2.018168
B -0.589001  0.188695

In [62]:
#comperision  in data frame is same as numpy
# it return bool value
df>0

       W      X      Y      Z    new
A  False   True  False   True  False
B   True  False   True  False  False
C  False   True   True   True   True
D   True   True   True   True   True
E  False  False  False   True  False

In [63]:
df[df>0] #return true value nd in place of false value return nan

          W         X         Y         Z       new
A       NaN  0.605965       NaN  0.740122       NaN
B  0.528813       NaN  0.188695       NaN       NaN
C       NaN  0.955057  0.190794  1.978757  0.021819
D  2.605967  0.683509  0.302665  1.693723  3.289476
E       NaN       NaN       NaN  0.390528       NaN

In [64]:
 df['W']>0

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [65]:
 df[df['W']>0] # this always return true value and return that row only in which condition  true

          W         X         Y         Z       new
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187
D  2.605967  0.683509  0.302665  1.693723  3.289476

In [66]:
df[df['Z']<0]#only only that row comes in output in which column value of Z <0

          W         X         Y         Z       new
B  0.528813 -0.589001  0.188695 -0.758872 -0.060187

In [67]:
df[df['W']>0]['X']# it return only that value from column in which W>0

B   -0.589001
D    0.683509
Name: X, dtype: float64

In [68]:
df[df['W']>0][['X','Z']]

          X         Z
B -0.589001 -0.758872
D  0.683509  1.693723

In [70]:
# mutiple condition
df[(df['W']>0) and (df['X'>1])]
#this give error becoz normal python and  make series ambigious so we hv to use bitwise operator

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [9]:
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
A  1.340897 -1.090153 -2.098477  0.398768
B  0.448847  1.818100 -0.412235 -1.043443

In [10]:
df[(df['W']>0) | (df['Y']<0)]

          W         X         Y         Z
A  1.340897 -1.090153 -2.098477  0.398768
B  0.448847  1.818100 -0.412235 -1.043443
C  1.022203 -0.605088  0.512316  0.055758

In [11]:
df

          W         X         Y         Z
A  1.340897 -1.090153 -2.098477  0.398768
B  0.448847  1.818100 -0.412235 -1.043443
C  1.022203 -0.605088  0.512316  0.055758
D -1.237667  0.417870  0.313260  0.739590
E -0.011148 -1.524037  0.077547  1.318637

In [23]:
#reset_index()
#by using this index we reset index with numeric index and privious index become new column
df.reset_index()
# use inplace=True for chnge in main dataframe otherwise it not chng in main table

  index         W         X         Y         Z
0     A  1.340897 -1.090153 -2.098477  0.398768
1     B  0.448847  1.818100 -0.412235 -1.043443
2     C  1.022203 -0.605088  0.512316  0.055758
3     D -1.237667  0.417870  0.313260  0.739590
4     E -0.011148 -1.524037  0.077547  1.318637

In [24]:
newindex = 'CA NY LA OR '.split()#it give list

In [25]:
newindex

['CA', 'NY', 'LA', 'OR', 'XD']

In [26]:
df['states'] = newindex #create new column in dataframe

In [27]:
df

          W         X         Y         Z states
A  1.340897 -1.090153 -2.098477  0.398768     CA
B  0.448847  1.818100 -0.412235 -1.043443     NY
C  1.022203 -0.605088  0.512316  0.055758     LA
D -1.237667  0.417870  0.313260  0.739590     OR
E -0.011148 -1.524037  0.077547  1.318637     XD

In [28]:
# use can also set index in place of reset index
# by using set_index()
df.set_index('states')
# it not create new column like reset_index() create coulmn of privious index

               W         X         Y         Z
states
CA      1.340897 -1.090153 -2.098477  0.398768
NY      0.448847  1.818100 -0.412235 -1.043443
LA      1.022203 -0.605088  0.512316  0.055758
OR     -1.237667  0.417870  0.313260  0.739590
XD     -0.011148 -1.524037  0.077547  1.318637

### 3. Missing Data

In [29]:

dict ={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [30]:
df1 = pd.DataFrame(dict)

In [31]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [32]:
df1.dropna()#it drop every row from dataframe which has 1 or more than 1 NaN or missing value

     A    B  C
0  1.0  5.0  1

In [33]:
df1.dropna(axis=1)
#it drop every column from dataframe which has 1 or more than 1 NaN or missing value

   C
0  1
1  2
2  3

In [34]:
df1.dropna(thresh=2)#threshold
# in this it take that row wich has atleast two non nan value only two row in our df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [35]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
#fillna method use to fill value in nan
df1.fillna(value="fill value")

            A           B  C
0           1           5  1
1           2  fill value  2
2  fill value  fill value  3

In [37]:
 df1['A'].fillna(value= df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### 4. Groupby

groupby allows u to group together rows based off of a column and perform an aggregate function
on them.

In [38]:
data = { 'company': ['goog','goog','MSFT','MSFT','FB','FB'],
          'person': ['sam','charlie','Amy','vanessa','carl','sarah'],
        'sales':[200,120,340,124,243,350]}

In [39]:
df2 = pd.DataFrame(data)

In [40]:
df2

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    MSFT      Amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [41]:
bycomp = df2.groupby('company')

In [42]:
bycomp

In [43]:
bycomp.mean()

         sales
company
FB       296.5
MSFT     232.0
goog     160.0

In [44]:
bycomp.sum()

         sales
company
FB         593
MSFT       464
goog       320

In [45]:
bycomp.std()

              sales
company
FB        75.660426
MSFT     152.735065
goog      56.568542

In [46]:
bycomp.sum().loc['FB']

sales    593
Name: FB, dtype: int64

In [47]:
df2.groupby('company').sum().loc['FB']#everything in one line

sales    593
Name: FB, dtype: int64

In [48]:
df2.groupby('company').count()

         person  sales
company
FB            2      2
MSFT          2      2
goog          2      2

In [49]:
df2.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
goog      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0

In [50]:
df2.groupby('company').describe().transpose()
# transpose change the format of describe

company              FB        MSFT        goog
sales count    2.000000    2.000000    2.000000
      mean   296.500000  232.000000  160.000000
      std     75.660426  152.735065   56.568542
      min    243.000000  124.000000  120.000000
      25%    269.750000  178.000000  140.000000
      50%    296.500000  232.000000  160.000000
      75%    323.250000  286.000000  180.000000
      max    350.000000  340.000000  200.000000

In [51]:
df2.groupby('company').describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### 5.Merging,Joining,and Concatenating

In [52]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3'],
                      'C': ['C0','C1','C2','C3'],
                       'd':['D0','D1','D2','D3']})

In [53]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                     'B': ['B4','B5','B6','B7'],
                      'C': ['C4','C5','C6','C6'],
                       'd':['D4','D5','D6','D7']})

In [54]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                     'B': ['B8','B9','B10','B11'],
                      'C': ['C8','C9','C10','C11'],
                       'd':['D8','D9','D10','D11']})

In [55]:
df1

    A   B   C   d
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [56]:
df2

    A   B   C   d
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C6  D7

In [57]:
df3

     A    B    C    d
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

#### concatenation
Concatention basically glues together DataFrame. Keep in mind  that  dimension should match along the axis you are
concatenating on. Use pd.concat and pass in a list of DataFrames  to concatenate together.

In [58]:
pd.concat([df1,df2,df3])

     A    B    C    d
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C6   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [59]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   d   A   B   C   d    A    B    C    d
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C6  D7  A11  B11  C11  D11

#### Merging
The merge function allows you to merge DataFrames together using a similar logic as merging SQL Tables together for example

In [60]:
left = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3'],
                       'key':['K0','K1','K2','K3']})

In [61]:
right = pd.DataFrame({'C':['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3'],
                       'key':['K0','K1','K2','K3']})

In [62]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [63]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [64]:
pd.merge(left,right, how='inner', on='key')#it merge on the basis of key column which is common

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [65]:
left1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3'],
                       'key1':['K0','K0','K1','K2'],
                        'key2':['K0','K1','K0','K1']})

In [66]:
right1 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3'],
                       'key1':['K0','K1','K1','K2'],
                        'key2':['K0','K0','K0','K0']})

In [67]:
pd.merge(left1,right1,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

#### Joining 
joining is a convenient  method for combining the columns of two potentially differently -indexed  DataFrame in to a single result DataFrame

In [68]:
left2 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']},
                       index=['K0','K1','K2','K3'])
right2 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3']},
                       index=['K0','K1','K2','K3'])

In [69]:
left2

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [70]:
right2

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

In [71]:
left2.join(right2)# automatically join based on index nd by default inner join

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [72]:
left2.join(right2, how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

### 6. Operation

In [73]:
df4 = pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,444],
    'col3':['abc','def','ghi','xyz']})
df4.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [74]:
#finding unique value in datavFrame
df4['col2'].unique()

array([444, 555, 666], dtype=int64)

In [75]:
#finding number of unique value in datavFrame
df4['col2'].nunique()

3

In [76]:
#count how many time unique value occure in a table
df4['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [77]:
df4[df4['col1']>2]#condition in table

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [78]:
df4[(df4['col1']>2) & (df4['col2']==444)]# multiple condition in table

   col1  col2 col3
3     4   444  xyz

In [79]:
df4['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [80]:
#apply() method it is one of most powerfull tool in pandas
#let define own function
def times2(x):
    return x*2
#to use our own function we use apply()

In [81]:
df4['col1'].apply(times2)#times two is applied in col1

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [82]:
#apply( ) can also use in builtin function
df4['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [83]:
#also use in lambda expression
df4['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [84]:
#removin column in df
df4.drop('col1',axis=1)#inplace must be true for chnge in main table

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [85]:
df4.columns#list of columns name

Index(['col1', 'col2', 'col3'], dtype='object')

In [86]:
df4.index#it return the index

RangeIndex(start=0, stop=4, step=1)

In [87]:
#sorting in dataFrame
df4.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [88]:
#checking null values
df4.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### 7. Data input and Output
#### csv
#### excel
#### html
#### sql

In [98]:
df5 = pd.read_csv(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\test.csv')
#To read a file pass the path to the file location as a string. Dontforget to mention the file name with extention

FileNotFoundError: [Errno 2] File ‪C:\Users\Siddesh Naik\Desktop\estonia-passenger-list.csv does not exist: '\u202aC:\\Users\\Siddesh Naik\\Desktop\\estonia-passenger-list.csv'

In [ ]:
df5

In [91]:
df5.to_csv(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\myout',index= False)
# if we not put index= false new cloumn of index created in our output file

NameError: name 'df5' is not defined

In [ ]:
pd.read_csv(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\myout')

In [ ]:
# excel for in same location
pd.read_excel(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\myout.xlsx',sheetname= 'seet1')
#give error  no excel file in that directory

In [ ]:
df5.to_excel(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\myout',sheet_name='seet1')
#error because excel file is not there

In [ ]:
#html data
data = pd.read_html('url')
#data is of list type becoz in html page data store in tables python take as lists
# to access data use indexing
data[0]

In [ ]:
#sql table

In [93]:
from sqlalchemy import create_engine
# here we impoting a module of sql which create a new engine for us

In [94]:
engine = create_engine('sqlite:///:memory:')
#here we r creating a sql engine for work

In [97]:
df.to_sql(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\table',engine)
#we have to specify the connection in which engine we r working

ValueError: Table 'C:\Users\hp\Desktop\ml\ml\Data\Titanic\table' already exists.

In [96]:
pd.read_sql(r'C:\Users\hp\Desktop\ml\ml\Data\Titanic\table',engine)

  index         W         X         Y         Z states
0     A  1.340897 -1.090153 -2.098477  0.398768     CA
1     B  0.448847  1.818100 -0.412235 -1.043443     NY
2     C  1.022203 -0.605088  0.512316  0.055758     LA
3     D -1.237667  0.417870  0.313260  0.739590     OR
4     E -0.011148 -1.524037  0.077547  1.318637     XD